Repository: marsop/kairos
Catalog: src/Budgetr.Shared/Resources/Strings.*.resx
Languages: de, gl

# NavOverview
source: Overview
de: Übersicht
gl: Visión xeral

# NavMeters
source: Meters
de: Zähler
gl: Contadores

# NavTimeline
source: Timeline
de: Zeitachse
gl: Cronoloxía

# NavHistory
source: History
de: Verlauf
gl: Historial

# NavSync
source: Sync
gl: Sincronización

# NavSettings
source: Settings
de: Einstellungen
gl: Axustes

# OfflineBanner
source: You are working offline
de: Sie arbeiten offline
gl: Estás traballando sen conexión

source: Install Budgetr
de: Budgetr installieren
gl: Instalar Budgetr

# InstallDesc
source: Add to home screen for quick access
de: Für schnellen Zugriff zum Startbildschirm hinzufügen
gl: Engadir á pantalla de inicio para acceso rápido

source: Install
de: Installieren
gl: Instalar

source: Current Balance
de: Aktueller Kontostand
gl: Saldo actual

# HoursUnit
source: hours
de: Stunden
gl: horas

# MeterActive
source: {0} active
de: {0} aktiv
gl: {0} activo

# NoEvents
source: No events recorded yet
de: Noch keine Ereignisse aufgezeichnet
gl: Aínda non hai eventos rexistrados

# StartMeterHint
source: Start a meter to begin tracking time
de: Starten Sie einen Zähler, um die Zeitmessung zu beginnen
gl: Inicia un contador para comezar a rexistrar o tempo

source: Active
de: Aktiv
gl: Activo

source: Delete
de: Löschen
gl: Eliminar

source: Started
de: Gestartet
gl: Iniciado

source: Ended
de: Beendet
gl: Rematado

source: Duration
de: Dauer
gl: Duración

source: Contribution
de: Beitrag
gl: Contribución

# DeleteEntryTitle
source: Delete Entry?
de: Eintrag löschen?
gl: Borrar entrada?

# DeleteEntryConfirm
source: Are you sure you want to delete this {0} entry?
de: Sind Sie sicher, dass Sie diesen {0}-Eintrag löschen möchten?
gl: Estás seguro de que queres borrar esta entrada de {0}?

# DeleteEntryWarning
source: This will remove {0} from your balance.
de: Dadurch werden {0} von Ihrem Guthaben abgezogen.
gl: Isto restará {0} do teu saldo.

source: Cancel
de: Abbrechen
gl: Cancelar

# TodayAt
source: Today at {0}
de: Heute um {0}
gl: Hoxe ás {0}

# YesterdayAt
source: Yesterday at {0}
de: Gestern um {0}
gl: Onte ás {0}

# DateTimeAt
source: {0} at {1}
de: {0} um {1}
gl: {0} ás {1}

source: Running
de: Läuft
gl: En execución

source: Tap to start
de: Tippen zum Starten
gl: Preme para iniciar

source: Rename meter
de: Zähler umbenennen
gl: Renomear contador

source: Delete meter
de: Zähler löschen
gl: Borrar contador

source: Save
de: Speichern
gl: Gardar

source: Add Meter
de: Zähler hinzufügen
gl: Engadir contador

source: Running for:
de: Läuft seit:
gl: En execución durante:

# NameRequired
source: Name is required
de: Name ist erforderlich
gl: O nome é obrigatorio

# NameLengthError
source: Name must be 1-40 characters
de: Der Name muss 1-40 Zeichen lang sein
gl: O nome debe ter entre 1 e 40 caracteres

# NoDataPeriod
source: No data for selected period
de: Keine Daten für den gewählten Zeitraum
gl: Non hai datos para o período seleccionado

source: Export Data
de: Daten exportieren
gl: Exportar datos

# ExportDesc
source: Download all your data (meters and events) as a JSON file.
de: Laden Sie alle Ihre Daten (Zähler und Ereignisse) als JSON-Datei herunter.
gl: Descarga todos os teus datos (contadores e eventos) como un ficheiro JSON.

source: Exporting...
de: Exportieren...
gl: Exportando...

source: Import Data
de: Daten importieren
gl: Importar datos

# ImportDesc
source: Replace your current data by importing a JSON file.
de: Ersetzen Sie Ihre aktuellen Daten durch Importieren einer JSON-Datei.
gl: Substitúe os teus datos actuais importando un ficheiro JSON.

source: Choose File
de: Datei auswählen
gl: Escoller ficheiro

# SelectedFile
source: Selected: {0}
de: Ausgewählt: {0}
gl: Seleccionado: {0}

source: Importing...
de: Importieren...
gl: Importando...

# GDriveSync
source: Google Drive Sync
gl: Sincronización con Google Drive

# GDriveDesc
source: Backup and restore your data using Google Drive.
de: Sichern und Wiederherstellen Ihrer Daten über Google Drive.
gl: Fai copias de seguridade e restaura os teus datos usando Google Drive.

# GDriveConfigNote
source: To use Google Drive sync, you need to configure an OAuth Client ID from Google Cloud Console.
de: Um die Google Drive-Synchronisierung zu nutzen, müssen Sie eine OAuth-Client-ID in der Google Cloud Console konfigurieren.
gl: Para usar a sincronización con Google Drive, necesitas configurar un ID de cliente OAuth dende a consola de Google Cloud.

source: OAuth Client ID:
gl: ID de cliente OAuth:

# EnterClientId
source: Enter your Client ID
de: Geben Sie Ihre Client-ID ein
gl: Introduce o teu ID de cliente

source: Configure
de: Konfigurieren
gl: Configurar

source: Signing in...
de: Anmeldung...
gl: Iniciando sesión...

source: Sign in with Google
de: Mit Google anmelden
gl: Iniciar sesión con Google

source: Reconfigure Client ID
de: Client-ID neu konfigurieren
gl: Reconfigurar ID de cliente

# SignedInAs
source: Signed in as {0}
de: Angemeldet als {0}
gl: Sesión iniciada como {0}

# LastBackup
source: Last backup: {0}
de: Letztes Backup: {0}
gl: Última copia: {0}

source: Backing up...
de: Datensicherung läuft...
gl: Realizando copia...

source: Backup to Drive
de: In Drive sichern
gl: Backup en Drive

source: Restoring...
de: Wiederherstellung läuft...
gl: Restaurando...

source: Restore from Drive
de: Von Drive wiederherstellen
gl: Restaurar dende Drive

# AutoSync
source: Auto-sync on changes
de: Auto-Sync bei Änderungen
gl: Auto-sincronizar cambios

source: Syncing...
de: Synchronisierung...
gl: Sincronizando...

# LastAutoSync
source: Last auto-sync: {0}
de: Letzter Auto-Sync: {0}
gl: Última auto-sincronización: {0}

# SyncFailedRetry
source: Sync failed - will retry on next change
de: Sync fehlgeschlagen - erneuter Versuch bei nächster Änderung
gl: Erro na sincronización - intentarase de novo no próximo cambio

# WatchingChanges
source: Watching for changes...
de: Warten auf Änderungen...
gl: Agardando cambios...

source: Sign Out
de: Abmelden
gl: Pechar sesión

source: Factory Reset
de: Werkseinstellungen
gl: Restablecemento de fábrica

# FactoryResetDesc
source: Reset the application to its initial state. Deletes all data.
de: Setzen Sie die Anwendung auf ihren ursprünglichen Zustand zurück. Löscht alle Daten.
gl: Restablece a aplicación ao seu estado inicial. Borra todos os datos.

# ResetApp
source: Reset Application
de: Anwendung zurücksetzen
gl: Restablecer aplicación

# PromptReset
source: Are you sure you want to reset the application? This will effectively delete ALL your data and cannot be undone.
de: Sind Sie sicher, dass Sie die Anwendung zurücksetzen möchten? Dadurch werden ALLE Ihre Daten endgültig gelöscht und dies kann nicht rückgängig gemacht werden.
gl: Estás seguro de que queres restablecer a aplicación? Isto borrará TODOS os teus datos e non se pode desfacer.

source: FINAL WARNING
de: LETZTE WARNUNG
gl: AVISO FINAL

# FinalWarningMsg
source: I am serious. This will wipe all meters, history, and settings. Are you absolutely sure?
de: Das ist mein Ernst. Dadurch werden alle Zähler, der Verlauf und die Einstellungen gelöscht. Sind Sie absolut sicher?
gl: Falo en serio. Isto borrará todos os contadores, o historial e os axustes. Estás absolutamente seguro?

source: Confirm
de: Bestätigen
gl: Confirmar

# SuccessGDriveConfig
source: Google Drive configured successfully!
de: Google Drive erfolgreich konfiguriert!
gl: Google Drive configurado correctamente!

# ErrorConfigFailed
source: Configuration failed: {0}
de: Konfiguration fehlgeschlagen: {0}
gl: Erro na configuración: {0}

# SuccessSignIn
source: Signed in successfully!
de: Erfolgreich angemeldet!
gl: Sesión iniciada correctamente!

# ErrorSignInCancelled
source: Sign in was cancelled.
de: Anmeldung wurde abgebrochen.
gl: O inicio de sesión foi cancelado.

# ErrorSignInFailed
source: Sign in failed: {0}
de: Anmeldung fehlgeschlagen: {0}
gl: Erro ao iniciar sesión: {0}

# SuccessSignOut
source: Signed out successfully.
de: Erfolgreich abgemeldet.
gl: Sesión pechada correctamente.

# ErrorSignOutFailed
source: Sign out failed: {0}
de: Abmeldung fehlgeschlagen: {0}
gl: Erro ao pechar sesión: {0}

# SuccessBackup
source: Backup completed successfully!
de: Backup erfolgreich abgeschlossen!
gl: Copia de seguridade realizada con éxito!

# ErrorBackupFailed
source: Backup failed: {0}
de: Backup fehlgeschlagen: {0}
gl: Erro na copia de seguridade: {0}

# ErrorNoBackup
source: No backup found in Google Drive.
de: Kein Backup in Google Drive gefunden.
gl: Non se atopou ningunha copia en Google Drive.

# SuccessRestore
source: Data restored successfully from Google Drive!
de: Daten erfolgreich von Google Drive wiederhergestellt!
gl: Datos restaurados con éxito dende Google Drive!

# ErrorRestoreFailed
source: Restore failed: {0}
de: Wiederherstellung fehlgeschlagen: {0}
gl: Erro na restauración: {0}

# SuccessExport
source: Data exported successfully!
de: Daten erfolgreich exportiert!
gl: Datos exportados con éxito!

# ErrorExportFailed
source: Export failed: {0}
de: Export fehlgeschlagen: {0}
gl: Erro ao exportar: {0}

# SuccessImport
source: Data imported successfully! Meters and events have been updated.
de: Daten erfolgreich importiert! Zähler und Ereignisse wurden aktualisiert.
gl: Datos importados con éxito! Os contadores e eventos foron actualizados.

# ErrorImportFailed
source: Import failed: {0}
de: Import fehlgeschlagen: {0}
gl: Erro ao importar: {0}

# SuccessAutoSyncEnabled
source: Auto-sync enabled. Changes will be backed up automatically.
de: Auto-Sync aktiviert. Änderungen werden automatisch gesichert.
gl: Auto-sincronización activada. Os cambios gardaranse automaticamente.

# SuccessAutoSyncDisabled
source: Auto-sync disabled.
de: Auto-Sync deaktiviert.
gl: Auto-sincronización desactivada.

# ErrorToggleAutoSync
source: Failed to toggle auto-sync: {0}
de: Auto-Sync konnte nicht umgeschaltet werden: {0}
gl: Erro ao cambiar a auto-sincronización: {0}

# ErrorResetFailed
source: Reset failed: {0}
de: Zurücksetzen fehlgeschlagen: {0}
gl: Erro ao restablecer: {0}

source: Display Language
de: Anzeigesprache
gl: Idioma de pantalla

source: About
de: Über
gl: Sobre nós

source: Version
gl: Versión

# TutorialIntro
source: Hi there! Welcome to 'Budgetr'! I'm your personal time budget guide. I'm here to help you get started with managing your time effectively!
de: Hallo! Willkommen bei 'Budgetr'! Ich bin dein persönlicher Zeitbudget-Guide. Ich bin hier, um dir den Einstieg in ein effektives Zeitmanagement zu erleichtern!
gl: Ola! Benvido a 'Budgetr'! Son o teu guía persoal para o orzamento de tempo. Estou aquí para axudarche a comezar a xestionar o teu tempo con eficacia!

# TutorialOverview
source: This is your 'Overview'. It gives you a quick snapshot of your current temporal budget health. You can see your total time balance and active meters at a glance.
de: Dies ist deine 'Übersicht'. Sie gibt dir einen schnellen Überblick über deinen aktuellen Zeitbudget-Status. Du siehst dein gesamtes Zeitguthaben und die aktiven Zähler auf einen Blick.
gl: Esta é a túa 'Visión xeral'. Ofrece unha imaxe rápida da saúde do teu orzamento temporal actual. Podes ver o teu saldo total de tempo e os contadores activos dunha ollada.

# TutorialMeters
source: Here in 'Meters', you define your activities! You can set up 'Meters' for things like Work, Study, or Leisure. Think of them as the pulse of your day.
de: Hier unter 'Zähler' definierst du deine Aktivitäten! Du kannst Zähler für Dinge wie Arbeit, Studium oder Freizeit einrichten. Betrachte sie als den Puls deines Tages.
gl: Aquí en 'Contadores' defines as túas actividades! Podes configurar contadores para cousas como Traballo, Estudo ou Lecer. Pensa neles como o pulso do teu día.

# TutorialTimeline
source: The 'Timeline' is your visual aid! 🔮 It projects your past time budget based on your recorded activities. Use it to see trends and plan ahead.
de: Die 'Zeitachse' ist deine visuelle Hilfe! 🔮 Sie stellt dein vergangenes Zeitbudget basierend auf deinen aufgezeichneten Aktivitäten dar. Nutze sie, um Trends zu erkennen und vorauszuplanen.
gl: A 'Cronoloxía' é a túa axuda visual! 🔮 Proxecta o teu orzamento de tempo pasado baseándose nas actividades rexistradas. Úsaa para ver tendencias e planificar con antelación.

# TutorialHistory
source: Want to see what happened in the past? The 'History' page keeps a log of all your entries and changes. It's great for tracking your activity habits.
de: Möchtest du sehen, was in der Vergangenheit passiert ist? Die 'Verlauf'-Seite führt ein Protokoll aller deiner Einträge und Änderungen. Sie ist ideal, um deine Aktivitätsgewohnheiten zu verfolgen.
gl: Queres ver o que pasou no pasado? A páxina de 'Historial' garda un rexistro de todas as túas entradas e cambios. É xenial para seguir os teus hábitos de actividade.

# TutorialSync
source: Finally, 'Sync' keeps your data safe! You can back up your time tracking data to Google Drive or export it locally. Never lose your progress!
de: Schließlich hält 'Sync' deine Daten sicher! Du kannst deine Zeittracking-Daten in Google Drive sichern oder lokal exportieren. Verliere nie deinen Fortschritt!
gl: Finalmente, 'Sincronización' mantén os teus datos seguros! Podes facer copias de seguridade dos teus datos de seguimento de tempo en Google Drive ou exportalos localmente. Non perdas nunca o teu progreso!

# TutorialCompletion
source: That's the basics! You're all set to take control of your time. If you need me again, just look for the help icon. Happy tracking! ✨
de: Das sind die Grundlagen! Du bist bereit, die Kontrolle über deine Zeit zu übernehmen. Wenn du mich wieder brauchst, schau einfach nach dem Hilfe-Symbol. Viel Spaß beim Tracken! ✨
gl: Eses son os puntos básicos! Xa estás listo para tomar o control do teu tempo. Se me necesitas de novo, busca a icona de axuda. Feliz seguimento! ✨

# TutorialGuideName
source: Guide
gl: Guía

# NextStep
source: Next
de: Weiter
gl: Seguinte

# ConfirmationDefaultTitle
source: Confirm Action
de: Aktion bestätigen
gl: Confirmar acción

# ConfirmationDefaultMessage
source: Are you sure you want to proceed?
de: Sind Sie sicher, dass Sie fortfahren möchten?
gl: Estás seguro de que queres continuar?

source: Tutorial Avatar
gl: Avatar do tutorial

source: Support
de: Unterstützung
gl: Apoio

# SupportDesc
source: If you find Budgetr useful, you can support its development by buying me a coffee! ☕
de: Wenn Sie Budgetr nützlich finden, können Sie die Entwicklung unterstützen, indem Sie mir einen Kaffee spendieren! ☕
gl: Se atopas útil Budgetr, podes apoiar o seu desenvolvemento convidándome a un café! ☕

source: Buy me a coffee
de: Spendier mir einen Kaffee
gl: Convídame a un café

source: Edit times
de: Zeiten bearbeiten
gl: Editar horarios

# EditTimesTitle
source: Edit Event Times
de: Ereigniszeiten bearbeiten
gl: Editar horarios do evento

source: Start Time
de: Startzeit
gl: Hora de inicio

source: End Time
de: Endzeit
gl: Hora de fin

# EndBeforeStart
source: End time must be after start time.
de: Die Endzeit muss nach der Startzeit liegen.
gl: A hora de fin debe ser posterior á de inicio.

# FutureEndTime
source: End time cannot be in the future.
de: Die Endzeit darf nicht in der Zukunft liegen.
gl: A hora de fin non pode ser no futuro.

source: Supabase Sync
de: Supabase-Synchronisierung
gl: Sincronización con Supabase

# SupabaseDesc
source: Backup and restore your data using Supabase cloud database.
de: Sichern und Wiederherstellen Ihrer Daten über die Supabase-Cloud-Datenbank.
gl: Fai copias de seguridade e restaura os teus datos usando a base de datos na nube de Supabase.

# SupabaseConfigNote
source: To use Supabase sync, enter your project URL and anon key from the Supabase dashboard.
de: Geben Sie zur Nutzung der Supabase-Synchronisierung Ihre Projekt-URL und den Anon-Key aus dem Supabase-Dashboard ein.
gl: Para usar a sincronización con Supabase, introduce a URL do teu proxecto e a clave anon do panel de Supabase.

# SupabaseUrl
source: Project URL:
de: Projekt-URL:
gl: URL do proxecto:

# SupabaseAnonKey
source: Anon Key:
gl: Clave anon:

# EnterSupabaseUrl
source: https://your-project.supabase.co
de: https://ihr-projekt.supabase.co
gl: https://o-teu-proxecto.supabase.co

# EnterAnonKey
source: Enter your anon key
de: Geben Sie Ihren Anon-Key ein
gl: Introduce a túa clave anon

# SupabaseConfiguredViaFile
source: Supabase is configured via settings file.
de: Supabase ist über die Einstellungsdatei konfiguriert.
gl: Supabase está configurado mediante ficheiro de axustes.

# SuccessSupabaseConfig
source: Supabase configured successfully!
de: Supabase erfolgreich konfiguriert!
gl: Supabase configurado correctamente!

# SignInEmail
source: Email:
gl: Correo electrónico:

# SignInPassword
source: Password:
de: Passwort:
gl: Contrasinal:

source: Sign In
de: Anmelden
gl: Iniciar sesión

source: Sign Up
de: Registrieren
gl: Rexistrarse

source: Signing up...
de: Registrierung...
gl: Rexistrando...

# SuccessSignUp
source: Account created and signed in successfully!
de: Konto erstellt und erfolgreich angemeldet!
gl: Conta creada e sesión iniciada correctamente!

# SuccessSignUpConfirm
source: Account created! Please check your email to confirm, then sign in.
de: Konto erstellt! Bitte bestätigen Sie Ihre E-Mail und melden Sie sich dann an.
gl: Conta creada! Comproba o teu correo para confirmar e logo inicia sesión.

# ErrorSignUpFailed
source: Sign up failed: {0}
de: Registrierung fehlgeschlagen: {0}
gl: Erro ao rexistrarse: {0}

source: Reconfigure Supabase
de: Supabase neu konfigurieren
gl: Reconfigurar Supabase

source: Backup to Supabase
de: In Supabase sichern
gl: Backup en Supabase

source: Restore from Supabase
de: Von Supabase wiederherstellen
gl: Restaurar dende Supabase

# ErrorNoSupabaseBackup
source: No backup found in Supabase.
de: Kein Backup in Supabase gefunden.
gl: Non se atopou ningunha copia en Supabase.

# SuccessSupabaseRestore
source: Data restored successfully from Supabase!
de: Daten erfolgreich von Supabase wiederhergestellt!
gl: Datos restaurados con éxito dende Supabase!

source: Browser Notifications
de: Browser-Benachrichtigungen
gl: Notificacións do navegador

# BrowserNotificationsDesc
source: Show system notifications when a meter is activated or deactivated
de: Systembenachrichtigungen anzeigen, wenn ein Meter aktiviert oder deaktiviert wird
gl: Mostrar notificacións do sistema cando un medidor se activa ou desactiva

# BrowserNotificationsDenied
source: Notifications blocked by browser. Please allow them in your browser settings.
de: Benachrichtigungen vom Browser blockiert. Bitte in den Browsereinstellungen erlauben.
gl: Notificacións bloqueadas polo navegador. Permiteas na configuración do navegador.

# NotificationMeterStartedTitle
source: ⏱️ Meter Started
de: ⏱️ Zähler Gestartet
gl: ⏱️ Contador Iniciado

# NotificationMeterStartedBody
source: You are now tracking '{0}'.
de: Du erfasst jetzt '{0}'.
gl: Agora estás rexistrando '{0}'.

# NotificationMeterStoppedTitle
source: ⏹️ Meter Stopped
de: ⏹️ Zähler Gestoppt
gl: ⏹️ Contador Detido

# NotificationMeterStoppedBody
source: You have stopped tracking '{0}'.
de: Du hast die Erfassung von '{0}' beendet.
gl: Deixaches de rexistrar '{0}'.

# NotificationSupabaseSignedInTitle
source: ✅ Signed In
de: ✅ Angemeldet
gl: ✅ Sesión iniciada

# NotificationSupabaseSignedInBody
source: Successfully signed in to Supabase.
de: Erfolgreich bei Supabase angemeldet.
gl: Iniciaches sesión en Supabase con éxito.

# NotificationSupabaseSignedOutTitle
source: 👋 Signed Out
de: 👋 Abgemeldet
gl: 👋 Sesión pechada

# NotificationSupabaseSignedOutBody
source: Successfully signed out of Supabase.
de: Erfolgreich von Supabase abgemeldet.
gl: Pechaches sesión en Supabase con éxito.

# NotificationTimeularConnectedTitle
source: 🧊 Timeular Connected
de: 🧊 Timeular verbunden
gl: 🧊 Timeular conectado

# NotificationTimeularConnectedBody
source: Successfully connected to your Timeular tracker.
de: Erfolgreich mit deinem Timeular-Tracker verbunden.
gl: Conectado correctamente ao teu rastrexador Timeular.

# NotificationTimeularDisconnectedTitle
source: 🔌 Timeular Disconnected
de: 🔌 Timeular getrennt
gl: 🔌 Timeular desconectado

# NotificationTimeularDisconnectedBody
source: Your Timeular tracker has been disconnected.
de: Dein Timeular-Tracker wurde getrennt.
gl: O teu rastrexador Timeular desconectouse.

# MeterFactor
source: Factor: {0}
de: Faktor: {0}

# TabLocal
source: Local
de: Lokal
